tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "samtay/tui"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Highly capable, feature-rich programming language
brew "perl"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Console Matrix
brew "cmatrix"
# Pure Scala Artifact Fetching
brew "coursier"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Package manager for the Lua programming language
brew "luarocks"
# Java-based project management
brew "maven"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package for scientific computing with Python
brew "numpy"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# General-purpose scripting language
brew "php"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Next-generation plugin manager for zsh
brew "zplug"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Display management tool
cask "betterdisplay"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Hardware benchmarking utility
cask "cinebench"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Clipboard manager for developers
cask "flycut"
# Web browser
cask "google-chrome"
# Grammarly for desktop
cask "grammarly-desktop"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Utility that shows the latest app updates
cask "latest"
# Clipboard manager
cask "maccy"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to extend trackpad functionality
cask "middleclick"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# SSH client
cask "termius"
# Unpacks archive files
cask "the-unarchiver"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Access etextbooks
cask "vitalsource-bookshelf"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "Catppuccin.catppuccin-vsc"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "letrieu.expand-region"
vscode "liviuschera.noctis"
vscode "meganrogge.template-string-converter"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "sainnhe.everforest"
vscode "silesky.toggle-boolean"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "WallabyJs.console-ninja"
